Revit 2027 API
BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionWrongType Property
 Structural Custom Connection has an inappropriate type assigned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralCustomConnectionWrongType { get; }
Public Shared ReadOnly Property StructuralCustomConnectionWrongType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralCustomConnectionWrongType {
	FailureDefinitionId^ get ();
}
static member StructuralCustomConnectionWrongType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace